{
  "backend/main.mo": "Motoko canister storing a static business profile and a list of inquiries with methods to submit and retrieve them.",
  "feature_evidence.json": "Feature evidence report listing two image‑replacement frontend tasks and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Plain-text JSON mapping of frontend file paths to short descriptions of their purpose and styling updates.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining color tokens, radii, and theming for light and dark modes.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app root.",
  "frontend/src/App.tsx": "Main SPA layout composing header, all sections, and footer.",
  "frontend/src/components/site/Footer.tsx": "Footer with company info, navigation shortcuts, social icons, and branding attribution.",
  "frontend/src/components/site/Header.tsx": "Responsive header with scroll-based styling, navigation links, and mobile menu.",
  "frontend/src/components/site/InquiryForm.tsx": "Inquiry form handling submission, validation, and success/error UI states.",
  "frontend/src/components/site/ProductCard.tsx": "Reusable card component displaying a product image, name, and description.",
  "frontend/src/components/site/Section.tsx": "Reusable layout wrapper component that renders a section with optional background and styling.",
  "frontend/src/components/site/sections/AboutSection.tsx": "Renders the About section with company description and feature cards highlighting strengths.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Displays contact information, business hours, and an inquiry form using business profile data.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Hero banner with background image, company headline, and buttons that scroll to contact or products.",
  "frontend/src/components/site/sections/MissionSection.tsx": "Shows the mission statement and value cards emphasizing quality and global connections.",
  "frontend/src/components/site/sections/ProductsSection.tsx": "Lists featured spice products using ProductCard components within a styled section.",
  "frontend/src/components/site/sections/QualityExportsSection.tsx": "Highlights export quality points and displays key stats about the company’s reliability.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, storing identity state, and handling login flows.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching a business profile and submitting inquiries through the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, typography, and premium component utility classes for the site's theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and extended theme values using CSS variables.",
  "project_state.json": "Stores project metadata, feature definitions, image requirements, and architectural notes for the spice exporter website."
}